#!/bin/sh
########################################################################
#
# C言語実装のCGIのリリースSHELL
# 引数にAPP_IDを指定する(./make_all.sh SUBTouR)
# 実行前にinclude/variables.h内をアプリケーションに合わせて変更すること
#
########################################################################

# 引数チェック
if [ $# -ne 1 ]; then
    echo "引数を指定してください。\$1:APP_ID (例: SUBTouR)"
    exit 1
else
    APP_ID=$1
fi

echo "+--------------------------------------------------------------------------------------"
echo "| include/variables.h内をアプリケーションに合わせて変更しましたか？ [y/n]"
echo "+--------------------------------------------------------------------------------------"
read ANS
echo 
if [ -z $ANS ]; then 
    exit 1
elif [ $ANS != 'y' -a $ANS != 'yes' ]; then
    exit 1
fi

#
# CalcDelayTime.c make & copy
#
echo "+--------------------------------------------------------------------------------------"
echo "| CalcDelayTimeをリリースしますか？ [y/n]"
echo "+--------------------------------------------------------------------------------------"
read ANS
echo 
if [ -z $ANS ]; then
:
elif [ $ANS = 'y' -o $ANS = 'yes' ]; then
    cd CalcDelayTime
    make clean
    make
    cp -p CalcDelayTime.exe /var/www/html/${APP_ID}/cgi/
    cd ../
    echo "+--------------------------------------------------------------------------------------"
    echo "| CalcDelayTimeをリリースしました"
    echo "+--------------------------------------------------------------------------------------"
fi

#
# DecideRosen.c make & copy
#
echo "+--------------------------------------------------------------------------------------"
echo "| DecideRosenをリリースしますか？ [y/n]"
echo "+--------------------------------------------------------------------------------------"
read ANS
echo
if [ -z $ANS ]; then
: 
elif [ $ANS = 'y' -o $ANS = 'yes' ]; then
    cd DecideRosen
    make clean
    make
    cp -p DecideRosen.exe /var/www/html/${APP_ID}/cgi/
    cd ../
    echo "+--------------------------------------------------------------------------------------"
    echo "| DecideRosenをリリースしました"
    echo "+--------------------------------------------------------------------------------------"
fi

#
# PassingBusStop.c make & copy
#
echo "+--------------------------------------------------------------------------------------"
echo "| PassingBusStopをリリースしますか？ [y/n]"
echo "+--------------------------------------------------------------------------------------"
read ANS
echo 
if [ -z $ANS ]; then
:
elif [ $ANS = 'y' -o $ANS = 'yes' ]; then
    cd PassingBusStop
    make clean
    make
    cp -p PassingBusStop.exe /var/www/html/${APP_ID}/cgi/
    cd ../
    echo "+--------------------------------------------------------------------------------------"
    echo "| PassingBusStopをリリースしました"
    echo "+--------------------------------------------------------------------------------------"
fi

